export const ALL_COUNTRIES = [
  {
    "id": "السعودية",
    "name": "المملكة العربية السعودية",
    "code": "+966"
  },
  {
    "id": "اليمن",
    "name": "اليمن",
    "code": "+967"
  },
  {
    "id": "عمان",
    "name": "سلطنة عمان",
    "code": "+968"
  },
  {
    "id": "الامارات",
    "name": "الإمارات العربية المتحدة",
    "code": "+971"
  },
  {
    "id": "الكويت",
    "name": "الكويت",
    "code": "+965"
  },
  {
    "id": "قطر",
    "name": "قطر",
    "code": "+974"
  },
  {
    "id": "البحرين",
    "name": "البحرين",
    "code": "+973"
  },
  {
    "id": "العراق",
    "name": "العراق",
    "code": "+964"
  },
  {
    "id": "سوريا",
    "name": "سوريا",
    "code": "+963"
  },
  {
    "id": "الاردن",
    "name": "الأردن",
    "code": "+962"
  },
  {
    "id": "فلسطين",
    "name": "فلسطين",
    "code": "+970"
  },
  {
    "id": "مصر",
    "name": "مصر",
    "code": "+20"
  },
  {
    "id": "ليبيا",
    "name": "ليبيا",
    "code": "+218"
  },
  {
    "id": "الجزائر",
    "name": "الجزائر",
    "code": "+213"
  },
  {
    "id": "المغرب",
    "name": "المغرب",
    "code": "+212"
  },
  {
    "id": "موريتانيا",
    "name": "موريتانيا",
    "code": "+222"
  },
  {
    "id": "السودان",
    "name": "السودان",
    "code": "+249"
  },
  {
    "id": "الصومال",
    "name": "الصومال",
    "code": "+252"
  },
  {
    "id": "جيبوتي",
    "name": "جيبوتي",
    "code": "+253"
  },
  {
    "id": "جزر القمر",
    "name": "جزر القمر",
    "code": "+269"
  },
  {
    "id": "تركيا",
    "name": "تركيا",
    "code": "+90"
  },
  {
    "id": "ايران",
    "name": "إيران",
    "code": "+98"
  },
  {
    "id": "باكستان",
    "name": "باكستان",
    "code": "+92"
  },
  {
    "id": "افغانستان",
    "name": "أفغانستان",
    "code": "+93"
  },
  {
    "id": "الهند",
    "name": "الهند",
    "code": "+91"
  },
  {
    "id": "اندونيسيا",
    "name": "إندونيسيا",
    "code": "+62"
  },
  {
    "id": "ماليزيا",
    "name": "ماليزيا",
    "code": "+60"
  },
  {
    "id": "الفلبين",
    "name": "الفلبين",
    "code": "+63"
  },
  {
    "id": "الصين",
    "name": "الصين",
    "code": "+86"
  },
  {
    "id": "اليابان",
    "name": "اليابان",
    "code": "+81"
  },
  {
    "id": "كوريا_الجنوبية",
    "name": "كوريا الجنوبية",
    "code": "+82"
  },
  {
    "id": "روسيا",
    "name": "روسيا",
    "code": "+7"
  },
  {
    "id": "المملكة_المتحدة",
    "name": "المملكة المتحدة",
    "code": "+44"
  },
  {
    "id": "فرنسا",
    "name": "فرنسا",
    "code": "+33"
  },
  {
    "id": "المانيا",
    "name": "ألمانيا",
    "code": "+49"
  },
  {
    "id": "ايطاليا",
    "name": "إيطاليا",
    "code": "+39"
  },
  {
    "id": "اسبانيا",
    "name": "إسبانيا",
    "code": "+34"
  },
  {
    "id": "هولندا",
    "name": "هولندا",
    "code": "+31"
  },
  {
    "id": "السويد",
    "name": "السويد",
    "code": "+46"
  },
  {
    "id": "النرويج",
    "name": "النرويج",
    "code": "+47"
  },
  {
    "id": "سويسرا",
    "name": "سويسرا",
    "code": "+41"
  },
  {
    "id": "كندا",
    "name": "كندا",
    "code": "+1"
  },
  {
    "id": "المكسيك",
    "name": "المكسيك",
    "code": "+52"
  },
  {
    "id": "البرازيل",
    "name": "البرازيل",
    "code": "+55"
  },
  {
    "id": "الارجنتين",
    "name": "الأرجنتين",
    "code": "+54"
  },
  {
    "id": "تشيلي",
    "name": "تشيلي",
    "code": "+56"
  },
  {
    "id": "استراليا",
    "name": "أستراليا",
    "code": "+61"
  },
  {
    "id": "نيوزيلندا",
    "name": "نيوزيلندا",
    "code": "+64"
  },
  {
    "id": "جنوب_افريقيا",
    "name": "جنوب أفريقيا",
    "code": "+27"
  },
  {
    "id": "نيجيريا",
    "name": "نيجيريا",
    "code": "+234"
  },
  {
    "id": "كينيا",
    "name": "كينيا",
    "code": "+254"
  },
  {
    "id": "أثيوبيا",
    "name": "أثيوبيا",
    "code": ""
  },
  {
    "id": "أذربيجان",
    "name": "أذربيجان",
    "code": ""
  },
  {
    "id": "أرمينيا",
    "name": "أرمينيا",
    "code": ""
  },
  {
    "id": "أروبا",
    "name": "أروبا",
    "code": ""
  },
  {
    "id": "أريتريا",
    "name": "أريتريا",
    "code": ""
  },
  {
    "id": "إستونيا",
    "name": "إستونيا",
    "code": ""
  },
  {
    "id": "إسواتيني",
    "name": "إسواتيني",
    "code": ""
  },
  {
    "id": "إفريقيا_الوسطى",
    "name": "إفريقيا الوسطى",
    "code": ""
  },
  {
    "id": "إكوادور",
    "name": "إكوادور",
    "code": ""
  },
  {
    "id": "ألبانيا",
    "name": "ألبانيا",
    "code": ""
  },
  {
    "id": "البرتغال",
    "name": "البرتغال",
    "code": ""
  },
  {
    "id": "البوسنة_والهرسك",
    "name": "البوسنة والهرسك",
    "code": ""
  },
  {
    "id": "التشيك",
    "name": "التشيك",
    "code": ""
  },
  {
    "id": "الجبل_الأسود",
    "name": "الجبل الأسود",
    "code": ""
  },
  {
    "id": "الدنمارك",
    "name": "الدنمارك",
    "code": ""
  },
  {
    "id": "الفاتيكان",
    "name": "الفاتيكان",
    "code": ""
  },
  {
    "id": "الكونغو",
    "name": "الكونغو",
    "code": ""
  },
  {
    "id": "الكونغو_الديمقراطية",
    "name": "الكونغو الديمقراطية",
    "code": ""
  },
  {
    "id": "المجر",
    "name": "المجر",
    "code": ""
  },
  {
    "id": "النمسا",
    "name": "النمسا",
    "code": ""
  },
  {
    "id": "النيجر",
    "name": "النيجر",
    "code": ""
  },
  {
    "id": "اليونان",
    "name": "اليونان",
    "code": ""
  },
  {
    "id": "أندورا",
    "name": "أندورا",
    "code": ""
  },
  {
    "id": "أنغولا",
    "name": "أنغولا",
    "code": ""
  },
  {
    "id": "أوروغواي",
    "name": "أوروغواي",
    "code": ""
  },
  {
    "id": "أوزبكستان",
    "name": "أوزبكستان",
    "code": ""
  },
  {
    "id": "أوغندا",
    "name": "أوغندا",
    "code": ""
  },
  {
    "id": "أوكرانيا",
    "name": "أوكرانيا",
    "code": ""
  },
  {
    "id": "أيرلندا",
    "name": "أيرلندا",
    "code": ""
  },
  {
    "id": "أيسلندا",
    "name": "أيسلندا",
    "code": ""
  },
  {
    "id": "بابوا_غينيا_الجديدة",
    "name": "بابوا غينيا الجديدة",
    "code": ""
  },
  {
    "id": "باراغواي",
    "name": "باراغواي",
    "code": ""
  },
  {
    "id": "بالاو",
    "name": "بالاو",
    "code": ""
  },
  {
    "id": "بلجيكا",
    "name": "بلجيكا",
    "code": ""
  },
  {
    "id": "بلغاريا",
    "name": "بلغاريا",
    "code": ""
  },
  {
    "id": "بليز",
    "name": "بليز",
    "code": ""
  },
  {
    "id": "بنما",
    "name": "بنما",
    "code": ""
  },
  {
    "id": "بنين",
    "name": "بنين",
    "code": ""
  },
  {
    "id": "بوتان",
    "name": "بوتان",
    "code": ""
  },
  {
    "id": "بوتسوانا",
    "name": "بوتسوانا",
    "code": ""
  },
  {
    "id": "بورتوريكو",
    "name": "بورتوريكو",
    "code": ""
  },
  {
    "id": "بوركينا_فاسو",
    "name": "بوركينا فاسو",
    "code": ""
  },
  {
    "id": "بوروندي",
    "name": "بوروندي",
    "code": ""
  },
  {
    "id": "بولندا",
    "name": "بولندا",
    "code": ""
  },
  {
    "id": "بوليفيا",
    "name": "بوليفيا",
    "code": ""
  },
  {
    "id": "بيرو",
    "name": "بيرو",
    "code": ""
  },
  {
    "id": "بيلاروسيا",
    "name": "بيلاروسيا",
    "code": ""
  },
  {
    "id": "تايلاند",
    "name": "تايلاند",
    "code": ""
  },
  {
    "id": "تايوان",
    "name": "تايوان",
    "code": ""
  },
  {
    "id": "تركمانستان",
    "name": "تركمانستان",
    "code": ""
  },
  {
    "id": "تشاد",
    "name": "تشاد",
    "code": ""
  },
  {
    "id": "تنزانيا",
    "name": "تنزانيا",
    "code": ""
  },
  {
    "id": "توغو",
    "name": "توغو",
    "code": ""
  },
  {
    "id": "توفالو",
    "name": "توفالو",
    "code": ""
  },
  {
    "id": "تونغا",
    "name": "تونغا",
    "code": ""
  },
  {
    "id": "تيمور_الشرقية",
    "name": "تيمور الشرقية",
    "code": ""
  },
  {
    "id": "جامايكا",
    "name": "جامايكا",
    "code": ""
  },
  {
    "id": "جزر_البهاما",
    "name": "جزر البهاما",
    "code": ""
  },
  {
    "id": "رواندا",
    "name": "رواندا",
    "code": ""
  },
  {
    "id": "رومانيا",
    "name": "رومانيا",
    "code": ""
  },
  {
    "id": "سلوفاكيا",
    "name": "سلوفاكيا",
    "code": ""
  },
  {
    "id": "سلوفينيا",
    "name": "سلوفينيا",
    "code": ""
  },
  {
    "id": "غرينادا",
    "name": "غرينادا",
    "code": ""
  },
  {
    "id": "غواتيمالا",
    "name": "غواتيمالا",
    "code": ""
  },
  {
    "id": "غيانا",
    "name": "غيانا",
    "code": ""
  },
  {
    "id": "غينيا",
    "name": "غينيا",
    "code": ""
  },
  {
    "id": "غينيا_الاستوائية",
    "name": "غينيا الاستوائية",
    "code": ""
  },
  {
    "id": "غينيا_بيساو",
    "name": "غينيا بيساو",
    "code": ""
  },
  {
    "id": "فانواتو",
    "name": "فانواتو",
    "code": ""
  },
  {
    "id": "فنزويلا",
    "name": "فنزويلا",
    "code": ""
  },
  {
    "id": "فنلندا",
    "name": "فنلندا",
    "code": ""
  },
  {
    "id": "فيجي",
    "name": "فيجي",
    "code": ""
  },
  {
    "id": "قبرص",
    "name": "قبرص",
    "code": ""
  },
  {
    "id": "كازاخستان",
    "name": "كازاخستان",
    "code": ""
  },
  {
    "id": "كرواتيا",
    "name": "كرواتيا",
    "code": ""
  },
  {
    "id": "كمبوديا",
    "name": "كمبوديا",
    "code": ""
  },
  {
    "id": "كوبا",
    "name": "كوبا",
    "code": ""
  },
  {
    "id": "كوت_ديفوار",
    "name": "كوت ديفوار",
    "code": ""
  },
  {
    "id": "كوريا_الشمالية",
    "name": "كوريا الشمالية",
    "code": ""
  },
  {
    "id": "كولومبيا",
    "name": "كولومبيا",
    "code": ""
  },
  {
    "id": "لاتفيا",
    "name": "لاتفيا",
    "code": ""
  },
  {
    "id": "لاوس",
    "name": "لاوس",
    "code": ""
  },
  {
    "id": "لبنان",
    "name": "لبنان",
    "code": ""
  },
  {
    "id": "لوكسمبورغ",
    "name": "لوكسمبورغ",
    "code": ""
  },
  {
    "id": "ليتوانيا",
    "name": "ليتوانيا",
    "code": ""
  },
  {
    "id": "ليختنشتاين",
    "name": "ليختنشتاين",
    "code": ""
  },
  {
    "id": "ليسوتو",
    "name": "ليسوتو",
    "code": ""
  },
  {
    "id": "ماكاو",
    "name": "ماكاو",
    "code": ""
  },
  {
    "id": "مالاوي",
    "name": "مالاوي",
    "code": ""
  },
  {
    "id": "مالطا",
    "name": "مالطا",
    "code": ""
  },
  {
    "id": "مالي",
    "name": "مالي",
    "code": ""
  },
  {
    "id": "مدغشقر",
    "name": "مدغشقر",
    "code": ""
  },
  {
    "id": "مقدونيا_الشمالية",
    "name": "مقدونيا الشمالية",
    "code": ""
  },
  {
    "id": "موريشيوس",
    "name": "موريشيوس",
    "code": ""
  },
  {
    "id": "موزمبيق",
    "name": "موزمبيق",
    "code": ""
  },
  {
    "id": "مولدوفا",
    "name": "مولدوفا",
    "code": ""
  },
  {
    "id": "موناكو",
    "name": "موناكو",
    "code": ""
  },
  {
    "id": "ميكرونيسيا",
    "name": "ميكرونيسيا",
    "code": ""
  },
  {
    "id": "ناميبيا",
    "name": "ناميبيا",
    "code": ""
  },
  {
    "id": "ناورو",
    "name": "ناورو",
    "code": ""
  },
  {
    "id": "نيبال",
    "name": "نيبال",
    "code": ""
  },
  {
    "id": "نيكاراغوا",
    "name": "نيكاراغوا",
    "code": ""
  },
  {
    "id": "هايتي",
    "name": "هايتي",
    "code": ""
  },
  {
    "id": "هندوراس",
    "name": "هندوراس",
    "code": ""
  }
];
export const getPhoneCode = (countryId: string) => {
  const c = ALL_COUNTRIES.find(c => c.id === countryId);
  return c ? (c.code || "") : "";
};
